src/cf/Documents/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТабельУчетаРабочегоВремени</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодВводаДанныхОВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыВводаДанныхОВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДанныеОВремени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КРВС_НормаЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КРВС_ОбоснованныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КРВС_НеобоснованныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КРВС_КонтрольПосещаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбоснованныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеобоснованныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ТабельУчетаРабочегоВремени/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура КРВС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	КРВС_ОпределитьДопустимоеВремяОтсутствийБезОбоснований();
	
	КРВС_УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура КРВС_ОрганизацияПриИзмененииПосле(Элемент)
	
	КРВС_ОпределитьДопустимоеВремяОтсутствийБезОбоснований();		
	
КонецПроцедуры

&НаКлиенте
Процедура КРВС_ПериодВводаДанныхОВремениПриИзмененииПосле(Элемент)
	
	КРВС_ОпределитьДопустимоеВремяОтсутствийБезОбоснований();		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеОВремени

&НаКлиенте
Процедура КРВС_ДанныеОВремениПриАктивизацииЯчейкиПосле(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеОВремени.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		КРВС_ОбнулитьДанныеПосещаемостиСотрудникаЗаДень();
		Возврат;
	КонецЕсли;
	
	НомерДня = УчетРабочегоВремениРасширенныйКлиентСервер.ТабельНомерДняПоИмениЭлемента(Элемент.ТекущийЭлемент.Имя);
	
	Если НомерДня = Неопределено Тогда 
		КРВС_ОбнулитьДанныеПосещаемостиСотрудникаЗаДень();
		Возврат;
	КонецЕсли;  
	
	КРВС_ВывестиДатуАктивнойЯчейкиТабеля(НомерДня);
	КРВС_ВывестиДанныеПосещаемостиСотрудникаЗаДень(ТекущиеДанные.Сотрудник, НомерДня);

КонецПроцедуры

&НаКлиенте
Процедура КРВС_ДанныеОВремениВремяПредставлениеПриИзмененииПосле(Элемент)
	
	НомерДня = УчетРабочегоВремениРасширенныйКлиентСервер.ТабельНомерДняПоИмениЭлемента(Элемент.Имя);
	ДанныеТекущейСтроки = Элементы.ДанныеОВремени.ТекущиеДанные;
	КРВС_КонтрольРабочегоВремениСотрудниковКлиентСервер.РассчитатьНеобоснованныеЧасыОтсутствияСотрудника(Объект, ДанныеТекущейСтроки.Сотрудник, НомерДня);			
	
	КРВС_ВывестиДанныеПосещаемостиСотрудникаЗаДень(ДанныеТекущейСтроки.Сотрудник, НомерДня);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&После("ПериодРегистрацииПриИзменении")
Процедура КРВС_ПериодРегистрацииПриИзменении()
	
	КРВС_ОпределитьДопустимоеВремяОтсутствийБезОбоснований();

КонецПроцедуры

&НаСервере
Процедура КРВС_ОпределитьДопустимоеВремяОтсутствийБезОбоснований()

	КРВС_ДопустимыеЧасыБезОбоснований = КРВС_КонтрольРабочегоВремениСотрудников.ДопустимыеЧасыОтсутствийБезОбоснований(Объект.Организация, Объект.ДатаНачалаПериода, Объект.ДатаОкончанияПериода);	

КонецПроцедуры

&НаСервере
Процедура КРВС_УстановитьУсловноеОформление()
		
	//  

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеОВремениКРВС_НеобоснованныеЧасы.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.ЭтоПерваяСтрокаПоСотруднику");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.КРВС_НеобоснованныеЧасы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	//  

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеОВремениКРВС_НеобоснованныеЧасы.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.ЭтоПерваяСтрокаПоСотруднику");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.КРВС_НеобоснованныеЧасы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);
	
	//  

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеОВремениКРВС_НеобоснованныеЧасы.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.ЭтоПерваяСтрокаПоСотруднику");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДанныеОВремени.КРВС_НеобоснованныеЧасы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("КРВС_ДопустимыеЧасыБезОбоснований");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	
КонецПроцедуры

&НаСервере
Процедура КРВС_ВывестиДанныеПосещаемостиСотрудникаЗаДень(Сотрудник, НомерДня)

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Сотрудник", Сотрудник);
	СтруктураПоиска.Вставить("НомерДня", НомерДня);  
	
	СтрокиКонтроляПоСотруднику = Объект.КРВС_КонтрольПосещаемости.НайтиСтроки(СтруктураПоиска); 
	Если СтрокиКонтроляПоСотруднику.Количество() = 0 Тогда 
		КРВС_ОбнулитьДанныеПосещаемостиСотрудникаЗаДень();
		Возврат;
	КонецЕсли; 
	
	СтрокаКонтроляВремениПоСотруднику = СтрокиКонтроляПоСотруднику[0]; 
	
	КРВС_НормаЧасовЗаДень = СтрокаКонтроляВремениПоСотруднику.НормаЧасов;
	КРВС_ОбоснованныеЧасыЗаДень = СтрокаКонтроляВремениПоСотруднику.ОбоснованныеЧасы;
	КРВС_НеобоснованныеЧасыЗаДень = СтрокаКонтроляВремениПоСотруднику.НеобоснованныеЧасы; 
		
КонецПроцедуры

&НаСервере
Процедура КРВС_ВывестиДатуАктивнойЯчейкиТабеля(НомерДня)

	ИндексДня = НомерДня - 1;
	СекундВСутках = 86400;

	КРВС_ТекущийДень = Объект.ПериодРегистрации + ИндексДня * СекундВСутках;
	
КонецПроцедуры

&НаСервере
Процедура КРВС_ОбнулитьДанныеПосещаемостиСотрудникаЗаДень()

	КРВС_НормаЧасовЗаДень = 0;
	КРВС_ОбоснованныеЧасыЗаДень = 0;
	КРВС_НеобоснованныеЧасыЗаДень = 0;

КонецПроцедуры

#КонецОбласти
